In [1]:
import numpy as np
import pandas as pd

In [2]:
series = pd.Series()
series

Series([], dtype: object)

In [3]:
narr = np.arange(10, dtype="int64")
series = pd.Series(narr)
series

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [4]:
data = {'a': 1, 'b': 2, 'c':3}
series = pd.Series(data)
series

a    1
b    2
c    3
dtype: int64

In [5]:
arr = [10, 20, 30, 40]
table = pd.DataFrame(arr)
table

    0
0  10
1  20
2  30
3  40

In [6]:
data = [{'a': 1, 'b': 2}, {'a':1, 'b': 2, 'c':3}]
table = pd.DataFrame(data)
table

   a  b    c
0  1  2  NaN
1  1  2  3.0

In [7]:
data = [{'a': 1, 'b': 2}, {'a':1, 'b': 2, 'c':3}]
table = pd.DataFrame(data, index=["first", "second"])
table

        a  b    c
first   1  2  NaN
second  1  2  3.0

In [8]:
data = {'a': pd.Series(narr), 'b': pd.Series(narr), 'c': pd.Series(narr)}
table = pd.DataFrame(data)
table

   a  b  c
0  0  0  0
1  1  1  1
2  2  2  2
3  3  3  3
4  4  4  4
5  5  5  5
6  6  6  6
7  7  7  7
8  8  8  8
9  9  9  9

In [9]:
table["b"] = pd.Series(np.arange(10, 20))
table

   a   b  c
0  0  10  0
1  1  11  1
2  2  12  2
3  3  13  3
4  4  14  4
5  5  15  5
6  6  16  6
7  7  17  7
8  8  18  8
9  9  19  9

In [10]:
del table["c"]
table

   a   b
0  0  10
1  1  11
2  2  12
3  3  13
4  4  14
5  5  15
6  6  16
7  7  17
8  8  18
9  9  19

In [11]:
table.pop('b')
table

   a
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

In [12]:
data = [{'a': 1, 'b': 2}, {'a':1, 'b': 2, 'c':3}]
table = pd.DataFrame(data, index=["first", "second"])
table

        a  b    c
first   1  2  NaN
second  1  2  3.0

In [13]:
table.loc["first"]

a    1.0
b    2.0
c    NaN
Name: first, dtype: float64

In [14]:
table.iloc[1]

a    1.0
b    2.0
c    3.0
Name: second, dtype: float64

In [15]:
table.drop("second")

       a  b   c
first  1  2 NaN

In [16]:
table.drop(columns=['a','b'])

          c
first   NaN
second  3.0

In [17]:
# READING DATA:- pd.read_csv, pd.read_excel
# WRITING DATA:- pd.to_csv, pd.to_excel